Revit 2027 API
Polyloop.Direction Property
 The direction for the outward normal for this polygon.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Direction { get; }
Public ReadOnly Property Direction As XYZ
	Get
public:
property XYZ^ Direction {
	XYZ^ get ();
}
member Direction : XYZ with get
Property Value
XYZ
See Also
Reference
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace